<a href="https://colab.research.google.com/github/EZZRITOE/cookie-recipe/blob/master/3Moringa_Data_Science_Prep_W3_Independent_Project_2019_07_Ezra_Mageto_DataReport_.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#  1.0 Importing our Libraries

In [1]:
# Importing the pandas library
# 
import pandas as pd

#1.1 Loading the Data

In [12]:
url ='cells_geo.csv'
df = pd.read_csv(url,delimiter=';', header =1, names = ['City','Status','Locality','Geographical_Zone','Zone_Name','Longitude','Latitude','Region','Area','Cell_ID','Site_ID'])
df

          City      Status   Locality  ...          Area     Cell_ID     Site_ID
1       ADJAME  In Service    ABIDJAN  ...           NaN  1502501d78  0bb492ef17
2       ADJAME  In Service    ABIDJAN  ...           NaN  0c2e182a0c  0bb492ef17
3      ASSINIE  In Service  INTERIEUR  ...           NaN  69bdfc69fd  8a1e6ce31f
4      ASSINIE  In Service  INTERIEUR  ...           NaN  7a1029d2ab  8a1e6ce31f
5      ASSINIE  In Service  INTERIEUR  ...           NaN  0b4f56438f  8a1e6ce31f
...        ...         ...        ...  ...           ...         ...         ...
3969  ZUENOULA  In Service  INTERIEUR  ...  CENTRE NORTH  1cfc2d7ab1  f91ed8d2e9
3970  ZUENOULA  In Service  INTERIEUR  ...  CENTRE NORTH  3ae1708153  f91ed8d2e9
3971  ZUENOULA  In Service  INTERIEUR  ...  CENTRE NORTH  cb71f8a29c  61bee9c70c
3972  ZUENOULA  In Service  INTERIEUR  ...  CENTRE NORTH  d4a6a0b645  61bee9c70c
3973  ZUENOULA  In Service  INTERIEUR  ...  CENTRE NORTH  f9f3e42589  61bee9c70c

[3973 rows x 11 columns]

##More about the Dataframe

In [15]:
#Dataframe info
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3973 entries, 1 to 3973
Data columns (total 11 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   City               3973 non-null   object
 1   Status             3906 non-null   object
 2   Locality           3973 non-null   object
 3   Geographical_Zone  3973 non-null   object
 4   Zone_Name          3967 non-null   object
 5   Longitude          3973 non-null   float64
 6   Latitude           3973 non-null   float64
 7   Region             3973 non-null   object
 8   Area               3951 non-null   object
 9   Cell_ID            3973 non-null   object
 10  Site_ID            3973 non-null   object
dtypes: float64(2), object(9)
memory usage: 372.5+ KB

In [16]:
df.describe()

         Longitude     Latitude
count  3973.000000  3973.000000
mean     -4.877880     6.244970
std       1.300861     1.304289
min      -8.503889     0.000000
25%      -5.846139     5.338639
50%      -4.084500     5.475000
75%      -3.993444     6.872306
max      -0.000000    10.481861

In [17]:
(df.isnull().sum())#cleaning of the dataframe

City                  0
Status               67
Locality              0
Geographical_Zone     0
Zone_Name             6
Longitude             0
Latitude              0
Region                0
Area                 22
Cell_ID               0
Site_ID               0
dtype: int64

In [19]:
df.Status.unique()

array(['In Service', nan], dtype=object)

#2.0 Analyzing the Data

In [58]:
#which were the most used cities for the three days
df.groupby('City').count().nlargest(3,'Cell_ID')

          Status  Locality  Geographical_Zone  ...  Area  Cell_ID  Site_ID
City                                           ...
COCODY       354       354                354  ...   354      354      354
YOPOUGON     289       295                295  ...   295      295      295
ABOBO        250       255                255  ...   247      255      255

[3 rows x 10 columns]

In [59]:
#Which cities were the most used during business and home hours?
df.groupby('City').count().nlargest(3,'Site_ID')

          Status  Locality  Geographical_Zone  ...  Area  Cell_ID  Site_ID
City                                           ...
COCODY       354       354                354  ...   354      354      354
YOPOUGON     289       295                295  ...   295      295      295
ABOBO        250       255                255  ...   247      255      255

[3 rows x 10 columns]

In [60]:
#Most used city for the three days?

df.groupby('City').count().nlargest(3,'Status')

          Status  Locality  Geographical_Zone  ...  Area  Cell_ID  Site_ID
City                                           ...
COCODY       354       354                354  ...   354      354      354
YOPOUGON     289       295                295  ...   295      295      295
ABOBO        250       255                255  ...   247      255      255

[3 rows x 10 columns]